tests/performance/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'

scenarios:
  - name: "Browse Products"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/api/products"
      - think: 2
      - get:
          url: "/api/categories"